{
  "clips": [
    {
      "title": "H1 Plays",
      "data": [
        {
          "key": "kg3te",
          "streamable": "https://streamable.com/s/kg3te",
          "description": "Playspedia H1 (Toothpaste). Drag cut from the 1 cutter. 2, 3, and 4 cutters clear deep. Likely looking for continuation cut from 3 or 4."
        },
        {
          "key": "gwanf",
          "streamable": "https://streamable.com/s/gwanf",
          "description": "Typical H1 cut. 1 cutter makes a longer cut across the front. 2, 3, and 4 cutter clear deep. In this situation, a simple poaches blows the entire play up."
        },
        {
          "key": "wouy7",
          "streamable": "https://streamable.com/s/wouy7",
          "description": "You should little to no push downfield if you are the drag cut else there is a good chance you will cause a pick! You are cutting under and across, the deep space will be taken by the clears."
        },
        {
          "key": "52e8r",
          "streamable": "https://streamable.com/s/52e8r",
          "description": "We run a H1 against a zone. When in doubt, run the play, and then crumble into the appropriate offense. While obviously no effective, gives a good demonstration of timing."
        },
        {
          "key": "zta3n",
          "streamable": "https://streamable.com/s/zta3n",
          "description": "We want to make sure the throw is out into space in front of our cutter. Adam (3) makes a good continuation cut."
        },
        {
          "key": "o7hvd",
          "streamable": "https://streamable.com/s/o7hvd",
          "description": "Another one from the backhand force. Okay continuation cut attempts. Notice each one quickly cleared the area. "
        }
      ]
    },
    {
      "title": "H2 Plays",
      "data": [
        {
          "key": "usbga",
          "streamable": "https://streamable.com/s/usbga",
          "description": "Playspedia - H2 (H20/Water) from Horizontal Stack. Drag from the 2 spot. Continues from the 3 or 4 spot to a bigger continue from 1."
        },
        {
          "key": "9ix8q",
          "streamable": "https://streamable.com/s/9ix8q",
          "description": "H2 followed immediately by a H1. Tarik does a good job making a continuation cut for the newly wide open lane."
        },
        {
          "key": "1af4f",
          "streamable": "https://streamable.com/s/1af4f",
          "description": "Quick H2 cut followed by a force side (4) clear and continuation cut from the 3. We'd prefer 3 pushing deeper for more under space."
        },
        {
          "key": "jeuy0",
          "streamable": "https://streamable.com/s/jeuy0",
          "description": "Great spacing for an H2. Patience for the continuation cuts is good. We were able to have 2 decent looks for The 2 cutter from the 4 and 3."
        }
      ]
    },
    {
      "title": "H3 Plays",
      "data": [
        {
          "key": "1l8jw",
          "streamable": "https://streamable.com/s/1l8jw",
          "description": "Playspedia - H3 (Diamond/Default) from a Horizontal stack. 2 and 3 run a diamond/circlular type cut. Force side cutter cuts under and across. Break side cutter cut deep and then under. Continue is coming from breakside wing or other diamond cutter."
        },
        {
          "key": "kg3ve",
          "streamable": "https://streamable.com/s/kg3ve",
          "description": "One of more more lazy H3s. We want Tarik to setting up further downfield. But an incorrect mark always makes it easy."
        },
        {
          "key": "4tvpo",
          "streamable": "https://streamable.com/s/4tvpo",
          "description": "Few things happen in this H3: 1) We want Steven creating an inside window. Whether that is starting a step or two further to the openside, or cutting slightly force and then across. 2) Kasper should at least see the fruits of Ethan's (2) cut. 3) Ethan hesitates in the lane for a hair. We want to continue that cut quickly across. 4) Double cut into the open space following the H3. Ideally, one times up a cut for the other. Simple communication would also be effective."
        },
        {
          "key": "9mgc3",
          "streamable": "https://streamable.com/s/9mgc3",
          "description": "Basic idea of a H3 is clearing space for the deep->under cutter (Tarik). As is the goal with many other plays such as H1, H2, H4... Kyle then makes a great continuation cut for Tarik."
        },
        {
          "key": "dm9ax",
          "streamable": "https://streamable.com/s/dm9ax",
          "description": "One of our better H3 plays. We want to see a better continute from Tarik here (originally 4). Make a deep look and plant and come under hard."
        },
        {
          "key": "veqwt",
          "streamable": "https://streamable.com/s/veqwt",
          "description": "H3 run backhand. Tarik (3) does a great job of pushing his defender downfield to gain more yards. Afterwards, we make two well timed and spaced under cuts for some good yards. "
        }
      ]
    },
    {
      "title": "H4 Plays",
      "data": [
        {
          "key": "ywzc4",
          "streamable": "https://streamable.com/s/ywzc4",
          "description": "Playspedia - H4 (Crash/Dario Kart) from Horizontal stack. Middle two cutters clear breakside. Breakside wing cutter moves deep and comes under into the vacated space. Continue either comes from the breakside or other wing depending on position."
        },
        {
          "key": "uhemt",
          "streamable": "https://streamable.com/s/uhemt",
          "description": "All plays are designed to open up space for others. If you are the main cut (the 1 spot in an H4), time your opening cut so you know everyone will be out of your way. In this scenario, Kyle began to come under before Jon (2) began clearing."
        },
        {
          "key": "r5p60",
          "streamable": "https://streamable.com/s/r5p60",
          "description": "Similiar to an H3 or H1/H2, when the disc is on the sideline, we need to adjust who is running the cuts. Tarik is generally far to make a timely cut. Ideally in this situation Kyle (1) and Jon (2) would have cleared breakside, and Longo (3) would have made the big under cut. Another possible scenario (such as what Pitt does) is 1, 2, and 3 clear and give the entire space to 4 (Tarik). Either is valid. In the end, a simple 'I am clearing' from Kyle or direction to Kyle, would be great!"
        },
        {
          "key": "pnhr7",
          "streamable": "https://streamable.com/s/pnhr7",
          "description": "H4 that gets looked off. Tarik makes a good clearing cut to open up the lane for a following cut to Kyle."
        },
        {
          "key": "u5upu",
          "streamable": "https://streamable.com/s/u5upu",
          "description": "Good H4 look, but lack of good continuation cuts. Falcore clears hard, but other cutters are too far away to make a good cut. With not obvious continuation coming, we need to let up and give the space to the dump. Too much happened too close to the disc too late into the stall."
        },
        {
          "key": "vlsqi",
          "streamable": "https://streamable.com/s/vlsqi",
          "description": "Another good H4 look with a decent continuation cut from Falcore. (Extra! Original Falcore pump fake.)"
        },
        {
          "key": "mcpvk",
          "streamable": "https://streamable.com/s/mcpvk",
          "description": "Lots happening in this clip. 1) Typical H4 2) The iso cutter is able to make the mark bite making for an easy around break. 3) Milo begins pushing towards the center of the field which allows his defender to open up his hips and see the field. 4) Milo does a good job of immediately recognizing the poach and sprinting deep. 5) As soon as Pinecone (the dump) sees Jon get the disc continuation, he should halt and stay back. Instead he tries to clear through and causes a foul."
        }
      ]
    }
  ]
}
