{
  "clips": [
    {
      "title": "V1 Plays",
      "data": [
        {
          "key": "jrwse",
          "streamable": "https://streamable.com/s/jrwse",
          "description": "Playspedia - V1 from Vertical stack. Front of the stack runs force side, fakes deep, and comes back for the under."
        },
        {
          "key": "5me0p",
          "streamable": "https://streamable.com/s/5me0p",
          "description": "Always run V1 on the throwers side. If disc is in the middle, run it force side."
        },
        {
          "key": "bezoy",
          "streamable": "https://streamable.com/s/bezoy",
          "description": "V1 fails because cutter falls. Front of stack is ready for the fill or bail out. V1 cutter simply clears asap."
        },
        {
          "key": "9bm5o",
          "streamable": "https://streamable.com/s/9bm5o",
          "description": "Quick clip. Tarik drives his defender up slightly to make the grab a little easier. Continuation cut needs to happen sooner."
        },
        {
          "key": "jajrd",
          "streamable": "https://streamable.com/s/jajrd",
          "description": "1) We need to clear the lane for a V1. Give isolation space for the cutter. The poach immediately stops any chance. 2) Chester needs to drive further into the open lane. It would have been to hard of a throw for Kasper. 3) V1 is generally bad in the endzone. There is little deep space and just space in general."
        }
      ]
    },
    {
      "title": "V2 Plays",
      "data": [
        {
          "key": "90wl6",
          "streamable": "https://streamable.com/s/90wl6",
          "description": "V2 from the center of the field. Notice the Tarik's defender hesitating a second to watch Longo's clear. Exactly what we want."
        },
        {
          "key": "c3k1y",
          "streamable": "https://streamable.com/s/c3k1y",
          "description": "V2 from the sideline. Also known as American. (Which is different from V2 in the middle of the field.) Front of the stack clears force side (like V1), dump clears upline, and 2nd in the stack comes in for the fill. Unfortunately, instead of clearing upline, the fill clears away from the disc for an impossible throw. If the fill doesn't go off, we clear back upline and the 3rd in the stack comes for the fill. (This is identical to a typical vert stack reset system!)"
        },
        {
          "key": "ajrzn",
          "streamable": "https://streamable.com/s/ajrzn",
          "description": "Incompleted V2 from the center. 1 clears up the force side, and 2 makes a breakside cut. 1) I think ideally, if the disc takes a while to get there, the 1 cutter can make the continuation cut. If it's quick or the deep defender drops off, likely the back of the stack needs to make something happen. In this case, it's a floaty throw which EZ (1 cutter) could have made a continue for if caught. 2) If we set the stack on the force side a step or two, we have the opportunity for an inside window. In this case, the around was the only option."
        },
        {
          "key": "45k4t",
          "streamable": "https://streamable.com/s/45k4t",
          "description": "V2 from the sideline (aka American)."
        },
        {
          "key": "vi5u4",
          "streamable": "https://streamable.com/s/vi5u4",
          "description": "V2 from the sideline (American). In American, both clearing cuts go towards the thrower, even if it's the breakside lane. Regardless, the front of the stack cleared hard and opened up an opportunity for the fill. The fill does a good job turning with the disc to the other side of the field."
        },
        {
          "key": "3lh2q",
          "streamable": "https://streamable.com/s/3lh2q",
          "description": "V2 from center of the field. Again, we'd prefer to see the stack set up slightly (1 or 2 steps) force side. Otherwise, pretty good. After the play, we had two good under opportunities."
        }
      ]
    },
    {
      "title": "V3 Plays",
      "data": [
        {
          "key": "y8gqu",
          "streamable": "https://streamable.com/s/y8gqu",
          "description": "Playspedia - V3 (Mushroom) from Vertical Stack. The last 2 cutters in the stack make unders in both directions. 3rd cutter sprints deep."
        },
        {
          "key": "jtx18",
          "streamable": "https://streamable.com/s/jtx18",
          "description": "Decently timed cutting. We want to see Kyle continuing the momentum with his pivot. If we doesn't get the backhand off, it will make the inside much easier."
        },
        {
          "key": "4nwfl",
          "streamable": "https://streamable.com/s/4nwfl",
          "description": "Well timed V3. I would rather see Tarik come under sooner and be the continue rather than Longo. (Tarik will get more yards.)"
        },
        {
          "key": "j64p7",
          "streamable": "https://streamable.com/s/j64p7",
          "description": "No real options for the handler. 1st cut doesn't go far enough to the force side for a via throw. 3rd cutter moves breakside. If we are in the corner, our first priority should be getting out of that corner safely. Another option could be centering the disc and then running V3."
        },
        {
          "key": "yedz5",
          "streamable": "https://streamable.com/s/yedz5",
          "description": "Initially cutters moved well. I generally find 3rd cutters timing too late. Only option for thrower was 1 on 1 sprint deep.However, Steven and Kyle do a good job clearing space for the scoring throw and cut."
        },
        {
          "key": "yc8o5",
          "streamable": "https://streamable.com/s/yc8o5",
          "description": "1 cutter (Jordan) should making a Nord-esque cut for Kasper. Go towards the force side and then look for the inside break. I am a fan of Jordan's 'playing dump' type stance. 3 (Tarik) wants to minimize creep and start a little more shallow. We need to be cognizant of the wind."
        },
        {
          "key": "jdert",
          "streamable": "https://streamable.com/s/jdert",
          "description": "I love Kyle's positioning as he takes his initial cut. He get's the defender behind him, and makes it an easy under. "
        },
        {
          "key": "6bu1w",
          "streamable": "https://streamable.com/s/6bu1w",
          "description": "I'd rather see Tarik making the continuation cut for Lunn's pump fake or Steven's under. However, Jordan, Tarik, and then Kasper all make good continuation cuts to lots of space."
        },
        {
          "key": "vt4ha",
          "streamable": "https://streamable.com/s/vt4ha",
          "description": "Ideal world after the V3, Tarik would come under quicker to the force side, Jon would minimize his creep, and Kasper would attack entire deep space for continuation."
        }
      ]
    },
    {
      "title": "V4 Plays",
      "data": [
      {
          "key": "d1s7j",
          "streamable": "https://streamable.com/s/d1s7j",
          "description": "Playspedia - V4 (Wheel) from Vertical Stack. Front of the stack moves breakside (or away from the disc). Back of stack moves force side (or same side of disc). Ideally, back of stack drops off to help deep cutter."
        },
        {
          "key": "niaux",
          "streamable": "https://streamable.com/s/niaux",
          "description": "Great example of V4. Tarik times it well coming back under for the continuation."
        },
        {
          "key": "3x3mi",
          "streamable": "https://streamable.com/s/3x3mi",
          "description": "One of the more awkward positions to run V4. 1) While this play worked, I'd rather see the rotation reversed. 2) Back of stack (Kyle) should have waited half a second longer to see if his guy responds to the deep cutter (Chester). 3) Deep cutter (Chester) needs to turn his cut into an under sooner."
        },
        {
          "key": "kxj9w",
          "streamable": "https://streamable.com/s/kxj9w",
          "description": "Back of stack (Tarik) begins to creep out into the lane. We are mainly looking for the easy under for this play and it's based on the back of the stack looking to help deep. Creeping into the lane decreases the chance he'll drop off."
        },
        {
          "key": "x48hw",
          "streamable": "https://streamable.com/s/x48hw",
          "description": "Run the V4 in the wrong rotation again. (Front of the stack should be cutting away from the disc. i.e It's not always the break side). Tarik's cut clogs the only throwing lane. The thrower's only option is to look dump. Also, notice the deep help, this is exactly what we want to see happen in the play. Makes for an easy under. In this scenario, I think push the stack slightly further away from the disc and reversing the cut cycle would be the best scenario. Steven could have even cut under for Lunn on the breakside as his guy bit the deep cut too."
        },
        {
          "key": "vkrrc",
          "streamable": "https://streamable.com/s/vkrrc",
          "description": "This play works great going downwind. If the last back doesn't look to help, it can be an easy goal. Also, notice how far Kasper get's away from the stack. This ensures there is no pick."
        }
      ]
    },
    {
      "title": "V5 Plays",
      "data": [
        {
          "key": "527bs",
          "streamable": "https://streamable.com/s/527bs",
          "description": "Playspedia - V5 (Flood) from Vertical stack. Flood play to either 4 or 5 in stack. (This player should be indicated by play caller.) Move on front of the stack's go. That is either force side if disc is centered OR away from the disc if disc on a sideline."
        },
        {
          "key": "klhk6",
          "streamable": "https://streamable.com/s/klhk6",
          "description": "Great V5. When the disc is on a sideline, cut AWAY from the disc. Otherwise, cut force sideif centered. I'd rather see the continuation cut from the back of the stack (Zach) rather than Jordan. Jordan sets up in the middle of the field which limits the setup and yards gained. Notice how many more yards Zach would have gained."
        },
        {
          "key": "fniv5",
          "streamable": "https://streamable.com/s/fniv5",
          "description": "Back of stack thought he was in a good spot until his under help suddenly left. This is exactly what the V5 is looking to setup. Kasper runs back to the front of the stack before Tarik finishes looking downfield. We want to give ample time for a cut to develop. Good time to come back into the stack is when they begin looking dump. (Same with a sidestack)"
        },
        {
          "key": "ou07v",
          "streamable": "https://streamable.com/s/ou07v",
          "description": "Surprisingly, this is not a zipper play. It's V5, but pick called because the stack didn't follow the front and run force side. Running AWAY from the disc will reduce the chance of a pick."
        },
        {
          "key": "ear74",
          "streamable": "https://streamable.com/s/ear74",
          "description": "This clip shows the value of setting the stack slightly more force side. The iso cutter, was forced to cut horizontally break side. We want to give an inside window for the mark to respect. Also, Kyle made a great bail out cut for Lunn, we want him yelling here."
        },
        {
          "key": "7lrzd",
          "streamable": "https://streamable.com/s/7lrzd",
          "description": "This is the biggest pitfall of a flood play. When an entire set moves in a general direction, something must be up! This heads up play is exactly what I want to see from the 3 in a bracket against a sidestack."
        }
      ]
    }
  ]
}
